org/roam/sqlite.org
:PROPERTIES:
:ID:       162f9fba-d1f9-44e8-ae9f-685c578523f1
:END:
#+title: sqlite
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container content
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t
* sqlite
** notes
- https://www.sqlite.org/limits.html
- stores each index and table as separate b-tree over the database pages
  - ~BEGIN CONCURRENT~ allows multiple writers with separate tables or index's separated by page size.
  - hctree concurrency for row level locking
    - uses session extension for leader-follower backend replication
    - higher page bit (48 bit) support higher storage limit of 1EiB
- single flat file database
- C source can be compiled to WASM/Javascript [[https://sqlite.org/fiddle/][sqlite.org/fiddle]]
- Replication options
  - dqlite
    - custom c library by canonical
  - rqlite
    - uses sqlite as storage engine
  - litefs
    - streaming replication to s3
    - fuse based file replication with 1 active writer in cluster
      - litestream for recovery
  - [[https://github.com/vlcn-io/cr-sqlite][crdt]] using last write wins
- libsql is a fork of sqlite with extra features
- strict tables for type enforcement
- session extension for changeset management
- max ~PRAGMA page_size = 65536~
  - powers of 2 ex ~16384~ for 16KiB
  - default 4096
  - require ~PRAGMA journal_mode = OFF~
- reduce wal before VACUUM INTO ~PRAGMA wal_checkpoint(TRUNCATE)~
- ~pragma integrity_check;~
- ~.recover~ command for corruption
- sqlar is file sqlite archive for in db compression of files (zlib)
- sqlite v3.4.0 added support wasm
  - opfs enabled when loaded from worker
    - opfs not limited in size unlike localstorage
    - currently locking issues between threads/tabs
- optimizer can create temporary index's automatically.
  dictated as ~USING AUTOMATIC COVERING INDEX~ in the ~explain~ query output
- import csv as virtual table or database
- ~pragma journal_mode = WAL;~ for write ahead log (replaced shared cache)
- ~pragma synchronous = normal;~
- ~pragma temp_store = memory;~ to disable temp writes
- ~pragma mmap_size = 30000000000;~ for memory mapping
- open in memory database with ~:memory:~
- foreign keys disabled in transactions and by default ~PRAGMA foreign keys~
