docs/sqlite.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>sqlite</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<nav class="navbar is-black" id="orgbee1dc0">
<div class="navbar-brand" id="org0fd06b2">
<div class="navbar-item" id="orgd757791">
<p>
<a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a>
</p>

</div>

</div>
<div class="navbar-menu" id="orgec3b238">
<div class="navbar-start" id="org99cf97f">
<div class="navbar-item" id="org1094e6e">
<p>
<a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a>
</p>

</div>

</div>
<div class="navbar-end" id="org0836b7e">

</div>

</div>
</nav>
<div id="outline-container-org897c14e" class="outline-2">
<h2 id="org897c14e">sqlite</h2>
<div class="outline-text-2" id="text-org897c14e">
</div>
<div id="outline-container-org0df4311" class="outline-3">
<h3 id="org0df4311">notes</h3>
<div class="outline-text-3" id="text-org0df4311">
<ul class="org-ul">
<li><a href="https://www.sqlite.org/limits.html">https://www.sqlite.org/limits.html</a></li>
<li>stores each index and table as separate b-tree over the database pages
<ul class="org-ul">
<li><code>BEGIN CONCURRENT</code> allows multiple writers with separate tables or index's separated by page size.</li>
<li>hctree concurrency for row level locking
<ul class="org-ul">
<li>uses session extension for leader-follower backend replication</li>
<li>higher page bit (48 bit) support higher storage limit of 1EiB</li>
</ul></li>
</ul></li>
<li>single flat file database</li>
<li>C source can be compiled to WASM/Javascript <a href="https://sqlite.org/fiddle/">sqlite.org/fiddle</a></li>
<li>Replication options
<ul class="org-ul">
<li>dqlite
<ul class="org-ul">
<li>custom c library by canonical</li>
</ul></li>
<li>rqlite
<ul class="org-ul">
<li>uses sqlite as storage engine</li>
</ul></li>
<li>litefs
<ul class="org-ul">
<li>streaming replication to s3</li>
<li>fuse based file replication with 1 active writer in cluster
<ul class="org-ul">
<li>litestream for recovery</li>
</ul></li>
</ul></li>
<li><a href="https://github.com/vlcn-io/cr-sqlite">crdt</a> using last write wins</li>
</ul></li>
<li>libsql is a fork of sqlite with extra features</li>
<li>strict tables for type enforcement</li>
<li>session extension for changeset management</li>
<li>max <code>PRAGMA page_size = 65536</code>
<ul class="org-ul">
<li>powers of 2 ex <code>16384</code> for 16KiB</li>
<li>default 4096</li>
<li>require <code>PRAGMA journal_mode = OFF</code></li>
</ul></li>
<li>reduce wal before VACUUM INTO <code>PRAGMA wal_checkpoint(TRUNCATE)</code></li>
<li><code>pragma integrity_check;</code></li>
<li><code>.recover</code> command for corruption</li>
<li>sqlar is file sqlite archive for in db compression of files (zlib)</li>
<li>sqlite v3.4.0 added support wasm
<ul class="org-ul">
<li>opfs enabled when loaded from worker
<ul class="org-ul">
<li>opfs not limited in size unlike localstorage</li>
<li>currently locking issues between threads/tabs</li>
</ul></li>
</ul></li>
<li>optimizer can create temporary index's automatically.
dictated as <code>USING AUTOMATIC COVERING INDEX</code> in the <code>explain</code> query output</li>
<li>import csv as virtual table or database</li>
<li><code>pragma journal_mode = WAL;</code> for write ahead log (replaced shared cache)</li>
<li><code>pragma synchronous = normal;</code></li>
<li><code>pragma temp_store = memory;</code> to disable temp writes</li>
<li><code>pragma mmap_size = 30000000000;</code> for memory mapping</li>
<li>open in memory database with <code>:memory:</code></li>
<li>foreign keys disabled in transactions and by default <code>PRAGMA foreign keys</code></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>